const http = require('http'); // Імпортуємо модуль HTTP для створення сервера та обробки HTTP-запитів

// Створюємо сервер
const server = http.createServer((req, res) => {
  // Приймаємо два аргументи: req (запит) і res (відповідь)
  // req - об'єкт запиту, містить інформацію про HTTP-запит клієнта
  // res - об'єкт відповіді, використовується для надсилання відповіді клієнту

  // Встановлюємо заголовок відповіді
  res.statusCode = 200; // Встановлюємо статус код відповіді HTTP як 200, що означає успішний запит
  res.setHeader('Content-Type', 'text/html; charset=utf-8'); // Встановлюємо заголовок Content-Type з кодуванням UTF-8

  // Відправляємо відповідь
  res.end('<h1>Привіт, Node.js!</h1>'); // Відсилаємо тіло відповіді 'Привіт, Node.js!' та закінчуємо відповідь
});

// Запускаємо сервер
server.listen(3000, () => {
  // Сервер слухає запити на порті 3000
  console.log('Server is running on port 3000'); // Виводимо повідомлення в консоль, що сервер запущено на порту 3000
});